Feature: Управление на теми

Background:
Given Вписва се потребител с администраторски права

  Scenario: Създаване на тема успешно
    Given Потребителят отваря екрана за създаване на тема
    When Въведе заглавие на тема: "test"
    And Натисне бутона за създаване
    Then Вижда съобщение: "Създадохте тема успешно!"
    
  Scenario: Създаване на тема без заглавие
    Given Потребителят отваря екрана за създаване на тема
    When Натисне бутона за създаване
    Then Вижда съобщение: "Моля, въведете заглавие на тема!"
    
   Scenario: Триене на тема от потребител с администраторски права
    Given Потребителят избира тема "testTopic"
    When Натисне бутона за триене  
    Then Вижда съобщение: "Темата е изтрита успешно!"
    
   Scenario: Добавяне на подтема успешно
     Given Потребителят отваря тема "testTopic"
     When Натиска върху добавяне на подтема
     And Въведе заглавие на подтема "subTopic"
     And Натисне бутона за добавяне на подтема
     Then Вижда съобщение: "Добавихте подтема успешно!"
     
    Scenario: Добавяне на подтема без заглавие
      Given Потребителят отваря тема "testTopic"
      When Натиска върху добавяне на подтема
      And Натисне бутона за добавяне на подтема
      Then Вижда съобщение: "Моля, въведете заглавие на подтема!"
     


